# Pandas

## Loading the data

In [1]:
import pandas as pd

In [6]:
path=input('Enter the path')

Enter the pathC:\Users\rs\Desktop\data\countries.csv

In [8]:
df=pd.read_csv(path)

In [9]:
df.head()

   id sortname            name  phonecode
0   1       AF     Afghanistan         93
1   2       AL         Albania        355
2   3       DZ         Algeria        213
3   4       AS  American Samoa       1684
4   5       AD         Andorra        376

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.columns

Index(['id', 'sortname', 'name', 'phonecode'], dtype='object')

### Getting info about the data

In [28]:
df.shape

(246, 4)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 246 entries, 0 to 245
Data columns (total 4 columns):
id           246 non-null int64
sortname     245 non-null object
name         246 non-null object
phonecode    246 non-null int64
dtypes: int64(2), object(2)
memory usage: 7.8+ KB

## Looking at the data

In [17]:
df['name']

0                               Afghanistan
1                                   Albania
2                                   Algeria
3                            American Samoa
4                                   Andorra
5                                    Angola
6                                  Anguilla
7                                Antarctica
8                       Antigua And Barbuda
9                                 Argentina
10                                  Armenia
11                                    Aruba
12                                Australia
13                                  Austria
14                               Azerbaijan
15                              Bahamas The
16                                  Bahrain
17                               Bangladesh
18                                 Barbados
19                                  Belarus
20                                  Belgium
21                                   Belize
22                                    Benin
23                                  Bermuda
24                                   Bhutan
25                                  Bolivia
26                   Bosnia and Herzegovina
27                                 Botswana
28                            Bouvet Island
29                                   Brazil
                       ...
216                                Thailand
217                                    Togo
218                                 Tokelau
219                                   Tonga
220                     Trinidad And Tobago
221                                 Tunisia
222                                  Turkey
223                            Turkmenistan
224                Turks And Caicos Islands
225                                  Tuvalu
226                                  Uganda
227                                 Ukraine
228                    United Arab Emirates
229                          United Kingdom
230                           United States
231    United States Minor Outlying Islands
232                                 Uruguay
233                              Uzbekistan
234                                 Vanuatu
235           Vatican City State (Holy See)
236                               Venezuela
237                                 Vietnam
238                Virgin Islands (British)
239                     Virgin Islands (US)
240               Wallis And Futuna Islands
241                          Western Sahara
242                                   Yemen
243                              Yugoslavia
244                                  Zambia
245                                Zimbabwe
Name: name, Length: 246, dtype: object

In [18]:
df.name

0                               Afghanistan
1                                   Albania
2                                   Algeria
3                            American Samoa
4                                   Andorra
5                                    Angola
6                                  Anguilla
7                                Antarctica
8                       Antigua And Barbuda
9                                 Argentina
10                                  Armenia
11                                    Aruba
12                                Australia
13                                  Austria
14                               Azerbaijan
15                              Bahamas The
16                                  Bahrain
17                               Bangladesh
18                                 Barbados
19                                  Belarus
20                                  Belgium
21                                   Belize
22                                    Benin
23                                  Bermuda
24                                   Bhutan
25                                  Bolivia
26                   Bosnia and Herzegovina
27                                 Botswana
28                            Bouvet Island
29                                   Brazil
                       ...
216                                Thailand
217                                    Togo
218                                 Tokelau
219                                   Tonga
220                     Trinidad And Tobago
221                                 Tunisia
222                                  Turkey
223                            Turkmenistan
224                Turks And Caicos Islands
225                                  Tuvalu
226                                  Uganda
227                                 Ukraine
228                    United Arab Emirates
229                          United Kingdom
230                           United States
231    United States Minor Outlying Islands
232                                 Uruguay
233                              Uzbekistan
234                                 Vanuatu
235           Vatican City State (Holy See)
236                               Venezuela
237                                 Vietnam
238                Virgin Islands (British)
239                     Virgin Islands (US)
240               Wallis And Futuna Islands
241                          Western Sahara
242                                   Yemen
243                              Yugoslavia
244                                  Zambia
245                                Zimbabwe
Name: name, Length: 246, dtype: object

#### Subsetting the data according to the columns

In [19]:
df[['name','sortname','phonecode']]

                                     name sortname  phonecode
0                             Afghanistan       AF         93
1                                 Albania       AL        355
2                                 Algeria       DZ        213
3                          American Samoa       AS       1684
4                                 Andorra       AD        376
5                                  Angola       AO        244
6                                Anguilla       AI       1264
7                              Antarctica       AQ          0
8                     Antigua And Barbuda       AG       1268
9                               Argentina       AR         54
10                                Armenia       AM        374
11                                  Aruba       AW        297
12                              Australia       AU         61
13                                Austria       AT         43
14                             Azerbaijan       AZ        994
15                            Bahamas The       BS       1242
16                                Bahrain       BH        973
17                             Bangladesh       BD        880
18                               Barbados       BB       1246
19                                Belarus       BY        375
20                                Belgium       BE         32
21                                 Belize       BZ        501
22                                  Benin       BJ        229
23                                Bermuda       BM       1441
24                                 Bhutan       BT        975
25                                Bolivia       BO        591
26                 Bosnia and Herzegovina       BA        387
27                               Botswana       BW        267
28                          Bouvet Island       BV          0
29                                 Brazil       BR         55
..                                    ...      ...        ...
216                              Thailand       TH         66
217                                  Togo       TG        228
218                               Tokelau       TK        690
219                                 Tonga       TO        676
220                   Trinidad And Tobago       TT       1868
221                               Tunisia       TN        216
222                                Turkey       TR         90
223                          Turkmenistan       TM       7370
224              Turks And Caicos Islands       TC       1649
225                                Tuvalu       TV        688
226                                Uganda       UG        256
227                               Ukraine       UA        380
228                  United Arab Emirates       AE        971
229                        United Kingdom       GB         44
230                         United States       US          1
231  United States Minor Outlying Islands       UM          1
232                               Uruguay       UY        598
233                            Uzbekistan       UZ        998
234                               Vanuatu       VU        678
235         Vatican City State (Holy See)       VA         39
236                             Venezuela       VE         58
237                               Vietnam       VN         84
238              Virgin Islands (British)       VG       1284
239                   Virgin Islands (US)       VI       1340
240             Wallis And Futuna Islands       WF        681
241                        Western Sahara       EH        212
242                                 Yemen       YE        967
243                            Yugoslavia       YU         38
244                                Zambia       ZM        260
245                              Zimbabwe       ZW        263

[246 rows x 3 columns]

In [24]:
l=list(range(1,4))

[1, 2, 3]

#### Subsetting the data according to the row

In [33]:
df.loc[0]

id                     1
sortname              AF
name         Afghanistan
phonecode             93
Name: 0, dtype: object

### There is a difference between Pandas Series and Pandas frame.Pandas frame consists of Pandas series

In [34]:
h=df.head(n=1)

In [35]:
type(h)

pandas.core.frame.DataFrame

In [36]:
type(df.loc[0])

pandas.core.series.Series

#### There is a difference between loc ,iloc and ix.

#### 1. loc gets rows (or columns) with particular labels from the index. 2. iloc gets rows (or columns) at particular positions in the index (so it only takes integers). 3.ix usually tries to behave like loc but falls back to behaving like iloc if a label is not present in the index.

In [37]:
df.iloc[34]

id                35
sortname          BI
name         Burundi
phonecode        257
Name: 34, dtype: object

In [38]:
df.iloc[[1,43,56]]

    id sortname            name  phonecode
1    2       AL         Albania        355
43  44       CN           China         86
56  57       CZ  Czech Republic        420

#### Subsetting both row and column at the same time

#### In iloc you have to pass the index as integer rather than the column name

In [41]:
df.iloc[23,2]

'Bermuda'

### In loc you have to pass the column name rather than the column index

In [43]:
df.loc[23,'name']

'Bermuda'

In [44]:
df.ix[23,'name']

C:\Users\rs\Anaconda3\envs\tensorflow\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

'Bermuda'

In [45]:
df.iloc[[12,32,45],[1,2,3]]

   sortname                     name  phonecode
12       AU                Australia         61
32       BG                 Bulgaria        359
45       CC  Cocos (Keeling) Islands        672

## Creating a Pandas Series object

In [46]:
s=pd.Series(['banana',42])

In [47]:
s

0    banana
1        42
dtype: object

In [49]:
s=pd.Series(['Rajat seeddharth','data scientist'],index=['Person','Title'])
s

Person    Rajat seeddharth
Title       data scientist
dtype: object

### Creating a Pandas Data frame

In [50]:
scientist=pd.DataFrame({'Name':['Rosalin franklin','walter white'],
                       'Age':[24,44],'Occupation':['Scientist','Chemist'],
                       'Born':['1970-07-25','1980-05-15']})

In [51]:
scientist

   Age        Born              Name Occupation
0   24  1970-07-25  Rosalin franklin  Scientist
1   44  1980-05-15      walter white    Chemist

In [57]:
s=scientist.iloc[0]
s

Age                         24
Born                1970-07-25
Name          Rosalin franklin
Occupation           Scientist
Name: 0, dtype: object

In [58]:
type(s)

pandas.core.series.Series

In [59]:
s.index

Index(['Age', 'Born', 'Name', 'Occupation'], dtype='object')

In [62]:
s.keys()

Index(['Age', 'Born', 'Name', 'Occupation'], dtype='object')

In [64]:
scientist.Age.mean()

34.0

In [65]:
path=input('Enter the path')

Enter the pathC:\Users\rs\Desktop\data\New Text Document.txt

In [66]:
df=pd.read_csv(path,sep=',')

In [67]:
df.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [68]:
df.Age.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [75]:
ages=df['Age']

In [76]:
ages.max()

90

In [77]:
ages[ages>ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [78]:
ages+ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [79]:
ages*ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [80]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [81]:
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [82]:
name=df.Name

In [83]:
name

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

## saving our data in pickle and csv format

In [84]:
name.to_pickle('name_series.pickle')

In [85]:
name.to_csv('name_series.csv')

## Concatenating data

Enter the pathC:\Users\rs\Desktop\machine learning\concat1.txt

In [92]:
df1=pd.read_csv(path,sep=',')

In [93]:
df3.head()

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [95]:
path=input('Enter the path')

Enter the pathC:\Users\rs\Desktop\machine learning\concat2.txt

In [96]:
df2=pd.read_csv(path,sep=',')

In [97]:
path=input('Enter the path')

Enter the pathC:\Users\rs\Desktop\machine learning\concat3.txt

In [98]:
df3=pd.read_csv(path,sep=',')

In [99]:
df3

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [100]:
df2

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [101]:
row_concat=pd.concat([df1,df2,df3])

In [102]:
row_concat

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [106]:
row_new=pd.DataFrame([['n1','n2','n3','n4']],columns=['A','B','C','D'])
pd.concat([row_concat,row_new])

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11
0   n1   n2   n3   n4

## Concatenating the data column wise

In [107]:
pd.concat([df1,df2,df3],axis=1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11